app/Controllers/Frontend/ProductController.php

			return redirect()->to('/profile')->withInput();
		}

		$merchants = $this->merchants->find($this->request->getVar('merchant_id'));
---
SELECT *
FROM `merchants`
WHERE `merchants`.`id` = '2'

			'slug' => url_title($this->request->getVar('product_name'), '-', true),
		];

		$this->products->save($data) ? session()->setFlashdata('success', 'Berhasil Mengirim Data Produk') :
---
INSERT INTO `products` (`product_name`, `category_id`, `merchant_id`, `product_price`, `product_status`, `product_thumbnail`, `product_description`, `stock`, `slug`) VALUES ('Test Produk', '14', '2', '1123123123', 'published', 'samueladadadadadadad/1650612772_eaafe7e3688fee248dd7.jpg', 'Ajshdjahsjd', '1', 'test-produk')