app/Controllers/Frontend/ProfileController.php

SELECT *
FROM `auth_groups_users`
WHERE `user_id` = '6'
SELECT *
FROM `merchants`
WHERE `user_id` = '6'
---
	public function index()
	{
		$level = $this->db->table('auth_groups_users')->getWhere(['user_id' => user_id()])->getFirstRow('array');
		$profile_status = $this->db->table('merchants')->getWhere(['user_id' => user_id()])->getFirstRow('array');

INSERT INTO `merchants` (`user_id`, `merchant_fullname`, `merchant_email`, `merchant_gender`, `merchant_phone`, `store_name`, `store_slug`, `store_address`, `store_image`, `ktp_image`, `store_logo`) VALUES ('6', 'Sa', 'testing@gmail.com', 'male', '081222556360', 'samueladadadadadadad', 'samueladadadadadadad', 'adr ,UJUNG HARAPAN ,SIMEULUE BARAT ,KABUPATEN SIMEULUE ,ACEH', '1650612576_cedd9179e844d09c0b8f.jpg', '1650612576_711a64fc0924df6acd7c.jpg', '1650612576_836153fd562ef0805390.jpg')
---
			'store_logo' => $store_logo_name,
		];

		$this->merchants->save($data) ? session()->setFlashdata('success', 'Berhasil Mengirim Request Keanggotaan') :