app/Controllers/Frontend/StoreController.php

SELECT *
FROM `merchants`
WHERE `merchants`.`id` = '2'
SELECT *
FROM `products`
WHERE `merchant_id` = '2'
---
    public function index()
    {
        $idmerchant = $this->request->getVar('id_merchant');

        $merchants = $this->merchants->find($idmerchant);

        $product = $this->products->where('merchant_id', $idmerchant)
            ->findAll();