app/Models/CategoriesModel.php

	public function getCategories()
	{
		$result = $this->select('categories.id, categories.category_slug, categories.category_name, categories.icon, COUNT(DISTINCT products.id) as total_product')
			->join('products', 'products.category_id = categories.id', 'left')
			->groupBy('categories.category_name')
			->get()->getResult('array');
---
SELECT `categories`.`id`, `categories`.`category_slug`, `categories`.`category_name`, `categories`.`icon`, COUNT(DISTINCT products.id) as total_product
FROM `categories`
LEFT JOIN `products` ON `products`.`category_id` = `categories`.`id`
GROUP BY `categories`.`category_name`