app/Models/ProductsModel.php

	public function getProducts($slug = false)
	{
		if ($slug == false) {
			return $this->findAll();
		}
		$result = $this->select('*')
			->join('categories', 'categories.id = products.category_id')
			->join('merchants', 'merchants.id = products.merchant_id')
			->where(['categories.category_slug' => $slug, 'products.product_status' => 'published'])
			->get()->getResult('array');
---
SELECT *
FROM `products`
SELECT *
FROM `products`
JOIN `categories` ON `categories`.`id` = `products`.`category_id`
JOIN `merchants` ON `merchants`.`id` = `products`.`merchant_id`
WHERE `categories`.`category_slug` = 'aksesoris-fashion'
AND `products`.`product_status` = 'published'